app/Http/Controllers/AnalyticsController.php

    public function index()
    {
        $user = auth()->user();

        // Get statistics
        $stats = [
            'total_conversations' => $user->conversations()->count(),
            'total_messages' => Message::whereHas('conversation', function ($q) use ($user) {
                $q->where('user_id', $user->id);
            })->count(),
            'active_conversations' => $user->conversations()->where('status', 'active')->count(),
            'completed_conversations' => $user->conversations()->where('status', 'completed')->count(),
        ];

        // Get recent activity (last 7 days)
        $recentActivity = Message::whereHas('conversation', function ($q) use ($user) {
            $q->where('user_id', $user->id);
        })
            ->where('created_at', '>=', now()->subDays(7))
            ->select(DB::raw('DATE(created_at) as date'), DB::raw('COUNT(*) as count'))
            ->groupBy('date')
            ->orderBy('date')
            ->get();

        // Get persona usage stats
        $personaStats = Message::whereHas('conversation', function ($q) use ($user) {
            $q->where('user_id', $user->id);
        })
            ->whereNotNull('persona_id')
            ->select('persona_id', DB::raw('COUNT(*) as message_count'))
            ->groupBy('persona_id')
            ->with('persona')
            ->orderByDesc('message_count')
            ->limit(10)
            ->get()
            ->map(function ($stat) {
                return [
                    'persona_name' => $stat->persona->name ?? 'Unknown',
                    'count' => $stat->message_count,
                ];
            });
---
select count(*) as aggregate from "conversations" where "conversations"."user_id" = 1 and "conversations"."user_id" is not null
select count(*) as aggregate from "messages" where exists (select * from "conversations" where "messages"."conversation_id" = "conversations"."id" and "user_id" = 1)
select count(*) as aggregate from "conversations" where "conversations"."user_id" = 1 and "conversations"."user_id" is not null and "status" = 'active'
select count(*) as aggregate from "conversations" where "conversations"."user_id" = 1 and "conversations"."user_id" is not null and "status" = 'completed'
select DATE(created_at) as date, COUNT(*) as count from "messages" where exists (select * from "conversations" where "messages"."conversation_id" = "conversations"."id" and "user_id" = 1) and "created_at" >= '2026-01-17 17:25:20' group by "date" order by "date" asc
select "persona_id", COUNT(*) as message_count from "messages" where exists (select * from "conversations" where "messages"."conversation_id" = "conversations"."id" and "user_id" = 1) and "persona_id" is not null group by "persona_id" order by "message_count" desc limit 10

            'stats' => $stats,
            'recentActivity' => $recentActivity,
            'personaStats' => $personaStats,
            'personas' => Persona::orderBy('name')->get(['id', 'name']),
---
select "id", "name" from "personas" order by "name" asc