app/Http/Controllers/ApiKeyController.php

    public function index()
    {
        return Inertia::render('ApiKeys/Index', [
            'apiKeys' => auth()->user()->apiKeys()->orderBy('provider')->latest()->get()->map(function ($key) {
                return [
                    'id' => $key->id,
                    'provider' => $key->provider,
                    'label' => $key->label,
                    'masked_key' => substr($key->key, 0, 8) . '...' . substr($key->key, -4),
                    'is_active' => (bool) $key->is_active,
                    'created_at' => $key->created_at,
                ];
            }),
        ]);
---
select * from "api_keys" where "api_keys"."user_id" = 1 and "api_keys"."user_id" is not null order by "provider" asc, "created_at" desc