app/Http/Controllers/ChatController.php

    public function index(): InertiaResponse
    {
        Log::info('ChatController::index loading personas', [
            'user_id' => auth()->id(),
            'persona_count' => Persona::count(),
        ]);

        return Inertia::render('Chat', [
            'personas' => Persona::orderBy('name')->get(),
            'conversations' => auth()->user()->conversations()->latest()->limit(50)->get(),
        ]);
---
select count(*) as aggregate from "personas"
select * from "personas" order by "name" asc
select * from "conversations" where "conversations"."user_id" = 1 and "conversations"."user_id" is not null order by "created_at" desc limit 50