app/Http/Controllers/PersonaController.php

select * from "personas" order by "created_at" desc
---
    public function index(): InertiaResponse
    {
        return Inertia::render('Personas/Index', [
            'personas' => Persona::latest()->get(),
        ]);